{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "block1_conv1", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block1_conv2", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv1", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block2_conv2", "trainable": false, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv1", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv2", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block3_conv3", "trainable": false, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv1", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv2", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block4_conv3", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv1", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv2", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block5_conv3", "trainable": false, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": false, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "valid", "strides": [4, 4], "data_format": "channels_last"}, "name": "average_pooling2d", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["average_pooling2d", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 9.999999747378752e-05, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "block1_conv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.6725833037320305, "scale": 0.005019278386059929, "original_dtype": "float32"}}, {"name": "block1_conv1/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.016312674593691734, "scale": 0.008156337296845867, "original_dtype": "float32"}}]}, {"paths": ["group2-shard1of1.bin"], "weights": [{"name": "block1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2157703659698075, "scale": 0.0019795446419248394, "original_dtype": "float32"}}, {"name": "block1_conv2/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.03059720993042, "scale": 0.007577920661253088, "original_dtype": "float32"}}]}, {"paths": ["group3-shard1of1.bin"], "weights": [{"name": "block2_conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.33643827718846936, "scale": 0.002951212957793591, "original_dtype": "float32"}}, {"name": "block2_conv1/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1794289034955642, "scale": 0.002136058374947193, "original_dtype": "float32"}}]}, {"paths": ["group4-shard1of1.bin"], "weights": [{"name": "block2_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1819109429331387, "scale": 0.0018010984448825612, "original_dtype": "float32"}}, {"name": "block2_conv2/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5976763715931014, "scale": 0.004819970738654043, "original_dtype": "float32"}}]}, {"paths": ["group5-shard1of1.bin"], "weights": [{"name": "block3_conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18258175195432177, "scale": 0.0028528398742862777, "original_dtype": "float32"}}, {"name": "block3_conv1/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.20076150368241702, "scale": 0.002158725846047495, "original_dtype": "float32"}}]}, {"paths": ["group6-shard1of1.bin"], "weights": [{"name": "block3_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17719967487980337, "scale": 0.002495770068729625, "original_dtype": "float32"}}, {"name": "block3_conv2/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18064890036395953, "scale": 0.0017886029739005893, "original_dtype": "float32"}}]}, {"paths": ["group7-shard1of1.bin"], "weights": [{"name": "block3_conv3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17920678737116794, "scale": 0.002240084842139599, "original_dtype": "float32"}}, {"name": "block3_conv3/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.14174636660837658, "scale": 0.0028927829920076856, "original_dtype": "float32"}}]}, {"paths": ["group8-shard1of1.bin"], "weights": [{"name": "block4_conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12366545971702127, "scale": 0.0017175758294030732, "original_dtype": "float32"}}, {"name": "block4_conv1/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.14622165473068463, "scale": 0.0018052056139590694, "original_dtype": "float32"}}]}, {"paths": ["group9-shard1of1.bin"], "weights": [{"name": "block4_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10595030150577134, "scale": 0.0017368901886192023, "original_dtype": "float32"}}, {"name": "block4_conv2/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08470387511393604, "scale": 0.0010457268532584696, "original_dtype": "float32"}}]}, {"paths": ["group10-shard1of1.bin"], "weights": [{"name": "block4_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12787745893001556, "scale": 0.0015044406932943008, "original_dtype": "float32"}}, {"name": "block4_conv3/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.19759350839783163, "scale": 0.0021020585999769323, "original_dtype": "float32"}}]}, {"paths": ["group11-shard1of1.bin"], "weights": [{"name": "block5_conv1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11315914199632757, "scale": 0.0011911488631192375, "original_dtype": "float32"}}, {"name": "block5_conv1/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.34960634918773875, "scale": 0.003884514990974875, "original_dtype": "float32"}}]}, {"paths": ["group12-shard1of1.bin"], "weights": [{"name": "block5_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13678494095802307, "scale": 0.0013410288329217949, "original_dtype": "float32"}}, {"name": "block5_conv2/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9140599073148241, "scale": 0.006575970556221757, "original_dtype": "float32"}}]}, {"paths": ["group13-shard1of1.bin"], "weights": [{"name": "block5_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09236334176624522, "scale": 0.0014897313188104069, "original_dtype": "float32"}}, {"name": "block5_conv3/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.5063331942932279, "scale": 0.03894870725332522, "original_dtype": "float32"}}]}, {"paths": ["group14-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [512, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.19304283226237579, "scale": 0.0016086902688531315, "original_dtype": "float32"}}, {"name": "dense/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.017246252795060472, "scale": 0.00012681068231662113, "original_dtype": "float32"}}]}, {"paths": ["group15-shard1of1.bin"], "weights": [{"name": "dense_1/kernel", "shape": [64, 2], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3379488899427302, "scale": 0.002747551950753904, "original_dtype": "float32"}}, {"name": "dense_1/bias", "shape": [2], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.009971036163030886, "scale": 7.78987200236788e-05, "original_dtype": "float32"}}]}]}